# Introduction
Anny seriously loves Japanese food so in the beginning of 2021, he decides to embark upon a risky venture and opens up a cute little restaurant that sells his 3 favourite foods: **sushi, curry and ramen.**

Anny’s Diner is in need of your assistance to help the restaurant stay afloat - the restaurant has captured some very basic data from their few months of operation but have no idea how to use their data to help them run the business.

## Problem_statement
Anny wants to use the data to answer a few simple questions about his customers, especially about their visiting patterns, how much money they’ve spent and also which menu items are their favourite. Having this deeper connection with his customers will help him deliver a better and more personalised experience for his loyal customers.

He plans on using these insights to help him decide whether he should expand the existing customer loyalty program - additionally he needs help to generate some basic datasets so his team can easily inspect the data without needing to use SQL.

Danny has provided you with a sample of his overall customer data due to privacy issues - but he hopes that these examples are enough for you to write fully functioning pandas code  to help him answer his questions!

Anny has shared with you 3 key datasets for this case study:

- sales
- menu
- members

### 1. Bring in the necessary libraries for your work. Import the tools and resources needed to accomplish your tasks.

In [220]:
import pandas as pd

### 2.Import the necessary data for analysis. Bring in the information that you need to examine and draw insights from.

In [221]:
members=pd.read_csv(r"C:\Users\mdimr\Downloads\members.csv")

In [222]:
members

  customer_id   join_date
0           A  2021-01-07
1           B  2021-01-09

In [223]:
menu=pd.read_csv(r"C:\Users\mdimr\Downloads\menu.csv")

In [224]:
menu

   product_id product_name  price
0           1        sushi     10
1           2        curry     15
2           3        ramen     12

In [225]:
sales=pd.read_csv(r"C:\Users\mdimr\Downloads\sales.csv")

In [226]:
sales

   customer_id  order_date  product_id
0            A  2021-01-01           1
1            A  2021-01-01           2
2            A  2021-01-07           2
3            A  2021-01-10           3
4            A  2021-01-11           3
5            A  2021-01-11           3
6            B  2021-01-01           2
7            B  2021-01-02           2
8            B  2021-01-04           1
9            B  2021-01-11           1
10           B  2021-01-16           3
11           B  2021-02-01           3
12           C  2021-01-01           3
13           C  2021-01-01           3
14           C  2021-01-07           3

### 3.Explore the details of all datasets by checking their information.

In [227]:
members.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  2 non-null      object
 1   join_date    2 non-null      object
dtypes: object(2)
memory usage: 164.0+ bytes

In [228]:
members.describe(include='all').T

            count unique         top freq
customer_id     2      2           A    1
join_date       2      2  2021-01-07    1

In [229]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  15 non-null     object
 1   order_date   15 non-null     object
 2   product_id   15 non-null     int64
dtypes: int64(1), object(2)
memory usage: 492.0+ bytes

In [230]:
sales.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
customer_id,15,3,A,6,NaN,NaN,NaN,NaN,NaN,NaN,NaN
order_date,15,8,2021-01-01,5,NaN,NaN,NaN,NaN,NaN,NaN,NaN
product_id,15.0,NaN,NaN,NaN,2.333333,0.816497,1.0,2.0,3.0,3.0,3.0

In [231]:
menu.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    3 non-null      int64
 1   product_name  3 non-null      object
 2   price         3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

In [232]:
menu.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
product_id,3.0,NaN,NaN,NaN,2.0,1.0,1.0,1.5,2.0,2.5,3.0
product_name,3,3,sushi,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
price,3.0,NaN,NaN,NaN,12.333333,2.516611,10.0,11.0,12.0,13.5,15.0

### 4.Make sure that each type of information (like numbers or dates) is stored in the correct way. This helps ensure that the data is accurate and ready for analysis, making your work more reliable and meaningful

In [233]:
sales['order_date']=sales['order_date'].astype('datetime64[ns]')
menu['price']=menu['price'].astype('float')
members['join_date']=members['join_date'].astype('datetime64[ns]')

### 1. What is the total amount each customer spent at the restaurant?

In [234]:
z=pd.merge(sales,menu,on='product_id',how='inner')
z

   customer_id order_date  product_id product_name  price
0            A 2021-01-01           1        sushi   10.0
1            B 2021-01-04           1        sushi   10.0
2            B 2021-01-11           1        sushi   10.0
3            A 2021-01-01           2        curry   15.0
4            A 2021-01-07           2        curry   15.0
5            B 2021-01-01           2        curry   15.0
6            B 2021-01-02           2        curry   15.0
7            A 2021-01-10           3        ramen   12.0
8            A 2021-01-11           3        ramen   12.0
9            A 2021-01-11           3        ramen   12.0
10           B 2021-01-16           3        ramen   12.0
11           B 2021-02-01           3        ramen   12.0
12           C 2021-01-01           3        ramen   12.0
13           C 2021-01-01           3        ramen   12.0
14           C 2021-01-07           3        ramen   12.0

In [235]:
z.groupby('customer_id')['price'].sum()

customer_id
A    76.0
B    74.0
C    36.0
Name: price, dtype: float64

### 2.How many days has each customer visited the restaurant?

In [236]:
sales.groupby('customer_id')['order_date'].nunique()

customer_id
A    4
B    6
C    2
Name: order_date, dtype: int64

### 3.What was the first item from the menu purchased by each customer?

In [237]:
data_sorted = z.sort_values(by=['customer_id', 'order_date'])
data_sorted['rank'] = data_sorted.groupby('customer_id')['order_date'].rank(method='first')
first_purchases = data_sorted[data_sorted['rank'] == 1]
first_purchases

   customer_id order_date  product_id product_name  price  rank
0            A 2021-01-01           1        sushi   10.0   1.0
5            B 2021-01-01           2        curry   15.0   1.0
12           C 2021-01-01           3        ramen   12.0   1.0

In [238]:
z['rank'] = z.groupby('customer_id')['order_date'].rank(method='first')
z['rank']

0     1.0
1     3.0
2     4.0
3     2.0
4     3.0
5     1.0
6     2.0
7     4.0
8     5.0
9     6.0
10    5.0
11    6.0
12    1.0
13    2.0
14    3.0
Name: rank, dtype: float64

### 4.What is the most purchased item on the menu and how many times was it purchased by all customers?

In [239]:
item_counts = z['product_name'].value_counts()
most_purchased_item = item_counts.idxmax()
purchase_count = item_counts.max()
print(item_counts)

product_name
ramen    8
curry    4
sushi    3
Name: count, dtype: int64

In [240]:
most_purchased_item

'ramen'

In [241]:
purchase_count

8

### 5.Which item was the most popular for each customer?

In [242]:
popular_items = z.groupby(['customer_id', 'product_name']).size().reset_index(name='count')
popular_items_sorted = popular_items.sort_values(by=['customer_id', 'count'], ascending=[True, False])

In [243]:
most_popular_items = popular_items_sorted.groupby('customer_id').head(1)

In [244]:
most_popular_items

  customer_id product_name  count
1           A        ramen      3
3           B        curry      2
6           C        ramen      3

### 6.Which item was purchased first by the customer after they became a member?

In [245]:
zy=pd.merge(sales,members,on='customer_id',how='inner')

In [246]:
zy

   customer_id order_date  product_id  join_date
0            A 2021-01-01           1 2021-01-07
1            A 2021-01-01           2 2021-01-07
2            A 2021-01-07           2 2021-01-07
3            A 2021-01-10           3 2021-01-07
4            A 2021-01-11           3 2021-01-07
5            A 2021-01-11           3 2021-01-07
6            B 2021-01-01           2 2021-01-09
7            B 2021-01-02           2 2021-01-09
8            B 2021-01-04           1 2021-01-09
9            B 2021-01-11           1 2021-01-09
10           B 2021-01-16           3 2021-01-09
11           B 2021-02-01           3 2021-01-09

In [247]:
df = zy[zy['order_date'] >= zy['join_date']]
first_orders = df.sort_values('order_date').groupby('customer_id').head(1)

In [248]:
first_orders

  customer_id order_date  product_id  join_date
2           A 2021-01-07           2 2021-01-07
9           B 2021-01-11           1 2021-01-09

### 7.Which item was purchased just before the customer became a member?

In [249]:
df = zy[zy['order_date'] < zy['join_date']]
last_orders = df.sort_values('order_date', ascending=False).groupby('customer_id').head(1)
last_orders

  customer_id order_date  product_id  join_date
8           B 2021-01-04           1 2021-01-09
0           A 2021-01-01           1 2021-01-07

### 8.What is the total items and amount spent for each member before they became a member?

In [250]:
zj=pd.merge(zj,menu)
zj

,customer_id,order_date,product_id,join_date,product_name,price,points,bonus_week
0,A,2021-01-01,1,2021-01-07,sushi,10.0,200.0,True
1,B,2021-01-04,1,2021-01-09,sushi,10.0,200.0,True
2,B,2021-01-11,1,2021-01-09,sushi,10.0,200.0,True
3,A,2021-01-01,2,2021-01-07,curry,15.0,300.0,True
4,A,2021-01-07,2,2021-01-07,curry,15.0,300.0,True
5,B,2021-01-01,2,2021-01-09,curry,15.0,300.0,True
6,B,2021-01-02,2,2021-01-09,curry,15.0,300.0,True
7,A,2021-01-10,3,2021-01-07,ramen,12.0,240.0,True
8,A,2021-01-11,3,2021-01-07,ramen,12.0,240.0,True
9,A,2021-01-11,3,2021-01-07,ramen,12.0,240.0,True
10,B,2021-01-16,3,2021-01-09,ramen,12.0,240.0,True
11,B,2021-02-01,3,2021-01-09,ramen,12.0,120.0,False

In [251]:
before_join = zj[zj['order_date'] < zj['join_date']]
results = before_join.groupby('customer_id').agg({'price': 'sum', 'product_id': 'count'})
results

             price  product_id
customer_id
A             25.0           2
B             40.0           3

### 9.If each $1 spent equates to 10 points and sushi has a 2x points multiplier - how many points would each customer have?

In [252]:
zj['points'] = zj['price'] * 10 
zj.loc[zj['product_name'] == 'sushi', 'points'] *= 2
zj.groupby('customer_id')['points'].sum().reset_index()

  customer_id  points
0           A   860.0
1           B   940.0

### 10.In the first week after a customer joins the program (including their join date) they earn 2x points on all items, not just sushi - how many points do customer A and B have at the end of January?

In [253]:
zj['points'] = zj['price'] * 10
zj['bonus_week'] = zj['order_date'] <= zj['join_date'] + pd.Timedelta(days=7)
zj.loc[zj['bonus_week'], 'points'] *= 2
results = zj.groupby('customer_id')['points'].sum().reset_index()
results

  customer_id  points
0           A  1520.0
1           B  1360.0